waterinthefall/FDU-Microelectronics-Development-Project/Drivers/FM33FK5xx_FL_Driver/Src/fm33fk5xx_fl_epwm.c
/**
  ****************************************************************************************************
  * @file    fm33fk5xx_fl_cmu.c
  * @author  FMSH Application Team
  * @brief   Src file of CMU FL Module
  *******************************************************************************************************
  * @attention
  *
  * Copyright (c) [2021] [Fudan Microelectronics]
  * THIS SOFTWARE is licensed under Mulan PSL v2.
  * You can use this software according to the terms and conditions of the Mulan PSL v2.
  * You may obtain a copy of Mulan PSL v2 at:
  *          http://license.coscl.org.cn/MulanPSL2
  * THIS SOFTWARE IS PROVIDED ON AN "AS IS" BASIS, WITHOUT WARRANTIES OF ANY KIND,
  * EITHER EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO NON-INFRINGEMENT,
  * MERCHANTABILITY OR FIT FOR A PARTICULAR PURPOSE.
  * See the Mulan PSL v2 for more details.
  *
  *******************************************************************************************************
  */
/* Includes ------------------------------------------------------------------*/
#include "fm33fk5xx_fl.h"

/** @addtogroup FM33FK5XX_FL_Driver
  * @{
  */

/** @addtogroup EPWM
  * @{
  */

#ifdef FL_EPWM_DRIVER_ENABLED

/* Private macros ------------------------------------------------------------*/
/** @addtogroup EPWM_FL_Private_Macros
  * @{
  */
#define IS_EPWM_INSTANCE(TIMx)                     (((TIMx) == EPWM0) ||((TIMx) == EPWM1) ||((TIMx) == EPWM2) ||((TIMx) == EPWM3) )

#define IS_FL_EPWM_COUNTERMODE(__VALUE__)                   (((__VALUE__)==FL_EPWM_COUNTER_MODE_UP)\
                                                          ||((__VALUE__)==FL_EPWM_COUNTER_MODE_DOWN)\
                                                          ||((__VALUE__)==FL_EPWM_COUNTER_MODE_UP_DOWN)\
                                                          ||((__VALUE__)==FL_EPWM_COUNTER_MODE_STOP))

#define IS_FL_EPWM_CLKSOURCE(__VALUE__)                   (((__VALUE__)==FL_CMU_EPWM_CLK_SOURCE_APBCLK)\
                                                          ||((__VALUE__)==FL_CMU_EPWM_CLK_SOURCE_USB_BCK_PSC)\
                                                          ||((__VALUE__)==FL_CMU_EPWM_CLK_SOURCE_PLLx2)\
                                                          ||((__VALUE__)==FL_CMU_EPWM_CLK_SOURCE_PLLx1))

#define IS_FL_EPWM_DEBUGMODE(__VALUE__)                   (((__VALUE__)==FL_EPWM_DEBUG_STOP)\
                                                          ||((__VALUE__)==FL_EPWM_DEBUG_STOP_UPDATE)\
                                                          ||((__VALUE__)==FL_EPWM_DEBUG_FREE_RUN))

#define IS_FL_EPWM_STARTCOUNTDIR(__VALUE__)               (((__VALUE__)==FL_EPWM_COUNTER_SYNC_DIR_UP)\
                                                          ||((__VALUE__)==FL_EPWM_COUNTER_SYNC_DIR_DOWN))

#define IS_FL_EPWM_CHANNEL(__VALUE__)                     (((__VALUE__)==FL_EPWM_CHANNEL_A)\
                                                          ||((__VALUE__)==FL_EPWM_CHANNEL_B))

#define IS_FL_EPWM_OCLOADTRIGGER(__VALUE__)               (((__VALUE__)==FL_EPWM_OC_LOAD_CNT_0)\
                                                           ||((__VALUE__)==FL_EPWM_OC_LOAD_CNT_PRD)\
                                                           ||((__VALUE__)==FL_EPWM_OC_LOAD_SYNC_RISING))

#define IS_FL_EPWM_OCMODE_CNTEQUALCMPB_DIRDOWN(__VALUE__)                (((__VALUE__)==FL_EPWM_OC_MODE_FROZEN)\
                                                                         ||((__VALUE__)==FL_EPWM_OC_MODE_LOW)\
                                                                         ||((__VALUE__)==FL_EPWM_OC_MODE_HIGH)\
                                                                         ||((__VALUE__)==FL_EPWM_OC_MODE_TOGGLE))

#define IS_FL_EPWM_OCMODE_CNTEQUALCMPB_DIRUP(__VALUE__)                 (((__VALUE__)==FL_EPWM_OC_MODE_FROZEN)\
                                                                         ||((__VALUE__)==FL_EPWM_OC_MODE_LOW)\
                                                                         ||((__VALUE__)==FL_EPWM_OC_MODE_HIGH)\
                                                                         ||((__VALUE__)==FL_EPWM_OC_MODE_TOGGLE))

#define IS_FL_EPWM_OCMODE_CNTEQUALCMPA_DIRDOWN(__VALUE__)               (((__VALUE__)==FL_EPWM_OC_MODE_FROZEN)\
                                                                         ||((__VALUE__)==FL_EPWM_OC_MODE_LOW)\
                                                                         ||((__VALUE__)==FL_EPWM_OC_MODE_HIGH)\
                                                                         ||((__VALUE__)==FL_EPWM_OC_MODE_TOGGLE))

#define IS_FL_EPWM_OCMODE_CNTEQUALCMPA_DIRUP(__VALUE__)                 (((__VALUE__)==FL_EPWM_OC_MODE_FROZEN)\
                                                                         ||((__VALUE__)==FL_EPWM_OC_MODE_LOW)\
                                                                         ||((__VALUE__)==FL_EPWM_OC_MODE_HIGH)\
                                                                         ||((__VALUE__)==FL_EPWM_OC_MODE_TOGGLE))

#define IS_FL_EPWM_OCMODE_CNTEQUALPRD(__VALUE__)                         (((__VALUE__)==FL_EPWM_OC_MODE_FROZEN)\
                                                                         ||((__VALUE__)==FL_EPWM_OC_MODE_LOW)\
                                                                         ||((__VALUE__)==FL_EPWM_OC_MODE_HIGH)\
                                                                         ||((__VALUE__)==FL_EPWM_OC_MODE_TOGGLE))

#define IS_FL_EPWM_OCMODE_CNTEQUALZRO(__VALUE__)                         (((__VALUE__)==FL_EPWM_OC_MODE_FROZEN)\
                                                                         ||((__VALUE__)==FL_EPWM_OC_MODE_LOW)\
                                                                         ||((__VALUE__)==FL_EPWM_OC_MODE_HIGH)\
                                                                         ||((__VALUE__)==FL_EPWM_OC_MODE_TOGGLE))

#define IS_FL_EPWM_CMPCHANNEL(__VALUE__)                                 (((__VALUE__)==FL_EPWM_COMPAREA)\
                                                                         ||((__VALUE__)==FL_EPWM_COMPAREB)\
                                                                         ||((__VALUE__)==FL_EPWM_COMPAREC)\
                                                                         ||((__VALUE__)==FL_EPWM_COMPARED))

#define IS_FL_EPWM_LOADCMPTRIGGER(__VALUE__)                             (((__VALUE__)==FL_EPWM_CMPD_LOAD_CNT_0)\
                                                                         ||((__VALUE__)==FL_EPWM_CMPD_LOAD_CNT_PRD)\
                                                                         ||((__VALUE__)==FL_EPWM_CMPD_LOAD_SYNC_RISING))

#define IS_FL_EPWM_REDSRC(__VALUE__)                                     (((__VALUE__)==FL_EPWM_DEADBAND_RISING_EPWMB)\
                                                                         ||((__VALUE__)==FL_EPWM_DEADBAND_RISING_EPWMA))

#define IS_FL_EPWM_FEDSRC(__VALUE__)                                     (((__VALUE__)==FL_EPWM_DEADBAND_FALLING_EPWMB)\
                                                                         ||((__VALUE__)==FL_EPWM_DEADBAND_FALLING_EPWMA))

#define IS_FL_EPWM_CHANNELBOUTPUTPOLAR(__VALUE__)                        (((__VALUE__)==FL_EPWM_DEADBAND_PORLARITY_NORMAL)\
                                                                         ||((__VALUE__)==FL_EPWM_DEADBAND_PORLARITY_REVERSE))

#define IS_FL_EPWM_CHANNELAOUTPUTPOLAR(__VALUE__)                        (((__VALUE__)==FL_EPWM_DEADBAND_PORLARITY_NORMAL)\
                                                                         ||((__VALUE__)==FL_EPWM_DEADBAND_PORLARITY_REVERSE))

#define IS_FL_EPWM_CHPHW_MASK(__VALUE__)                                 (__VALUE__<=63U)
#define IS_FL_EPWM_CHPLW_MASK(__VALUE__)                                 (__VALUE__<=63U)
#define IS_FL_EPWM_OSP_MASK(__VALUE__)                                   (__VALUE__<=15U)

