waterinthefall/FDU-Microelectronics-Development-Project/Drivers/FM33FK5xx_FL_Driver/Src/fm33fk5xx_fl_epwm.c
#define IS_FL_EPWM_DCBEVTACTIVE(__VALUE__)                             (((__VALUE__)==FL_EPWM_DIGITAL_COMPARE_DISABLE)\
                                                                         ||((__VALUE__)==FL_EPWM_DIGITAL_COMPARE_DCH_LOW)\
                                                                         ||((__VALUE__)==FL_EPWM_DIGITAL_COMPARE_DCH_HIGH)\
                                                                         ||((__VALUE__)==FL_EPWM_DIGITAL_COMPARE_DCL_LOW)\
                                                                         ||((__VALUE__)==FL_EPWM_DIGITAL_COMPARE_DCL_HIGH)\
                                                                         ||((__VALUE__)==FL_EPWM_DIGITAL_COMPARE_DCH_LOWANDDCL_HIGH)\
                                                                         ||((__VALUE__)==FL_EPWM_DIGITAL_COMPARE_DCH_HIGHANDDCL_LOW))

#define IS_FL_EPWM_DCAEVTACTIVE(__VALUE__)                              (((__VALUE__)==FL_EPWM_DIGITAL_COMPARE_DISABLE)\
                                                                         ||((__VALUE__)==FL_EPWM_DIGITAL_COMPARE_DCH_LOW)\
                                                                         ||((__VALUE__)==FL_EPWM_DIGITAL_COMPARE_DCH_HIGH)\
                                                                         ||((__VALUE__)==FL_EPWM_DIGITAL_COMPARE_DCL_LOW)\
                                                                         ||((__VALUE__)==FL_EPWM_DIGITAL_COMPARE_DCL_HIGH)\
                                                                         ||((__VALUE__)==FL_EPWM_DIGITAL_COMPARE_DCH_LOWANDDCL_HIGH)\
                                                                         ||((__VALUE__)==FL_EPWM_DIGITAL_COMPARE_DCH_HIGHANDDCL_LOW))

#define IS_FL_EPWM_DCBLINPUTSRC(__VALUE__)                               (((__VALUE__)==FL_EPWM_INPUT_SOURCE_BK1)\
                                                                         ||((__VALUE__)==FL_EPWM_INPUT_SOURCE_BK2)\
                                                                         ||((__VALUE__)==FL_EPWM_INPUT_SOURCE_BK3)\
                                                                         ||((__VALUE__)==FL_EPWM_INPUT_SOURCE_COMP1OUT)\
                                                                         ||((__VALUE__)==FL_EPWM_INPUT_SOURCE_COMP2OUT)\
                                                                         ||((__VALUE__)==FL_EPWM_INPUT_SOURCE_COMP3OUT))

#define IS_FL_EPWM_DCBHINPUTSRC(__VALUE__)                               (((__VALUE__)==FL_EPWM_INPUT_SOURCE_BK1)\
                                                                         ||((__VALUE__)==FL_EPWM_INPUT_SOURCE_BK2)\
                                                                         ||((__VALUE__)==FL_EPWM_INPUT_SOURCE_BK3)\
                                                                         ||((__VALUE__)==FL_EPWM_INPUT_SOURCE_COMP1OUT)\
                                                                         ||((__VALUE__)==FL_EPWM_INPUT_SOURCE_COMP2OUT)\
                                                                         ||((__VALUE__)==FL_EPWM_INPUT_SOURCE_COMP3OUT))

#define IS_FL_EPWM_DCALINPUTSRC(__VALUE__)                               (((__VALUE__)==FL_EPWM_INPUT_SOURCE_BK1)\
                                                                         ||((__VALUE__)==FL_EPWM_INPUT_SOURCE_BK2)\
                                                                         ||((__VALUE__)==FL_EPWM_INPUT_SOURCE_BK3)\
                                                                         ||((__VALUE__)==FL_EPWM_INPUT_SOURCE_COMP1OUT)\
                                                                         ||((__VALUE__)==FL_EPWM_INPUT_SOURCE_COMP2OUT)\
                                                                         ||((__VALUE__)==FL_EPWM_INPUT_SOURCE_COMP3OUT))

#define IS_FL_EPWM_DCAHINPUTSRC(__VALUE__)                               (((__VALUE__)==FL_EPWM_INPUT_SOURCE_BK1)\
                                                                         ||((__VALUE__)==FL_EPWM_INPUT_SOURCE_BK2)\
                                                                         ||((__VALUE__)==FL_EPWM_INPUT_SOURCE_BK3)\
                                                                         ||((__VALUE__)==FL_EPWM_INPUT_SOURCE_COMP1OUT)\
                                                                         ||((__VALUE__)==FL_EPWM_INPUT_SOURCE_COMP2OUT)\
                                                                         ||((__VALUE__)==FL_EPWM_INPUT_SOURCE_COMP3OUT))

#define IS_FL_EPWM_PCNTSEL(__VALUE__)                                    (((__VALUE__)==FL_EPWM_COUNT_IE_SOURCE_CNT_0)\
                                                                         ||((__VALUE__)==FL_EPWM_COUNT_IE_SOURCE_CNT_PRD)\
                                                                         ||((__VALUE__)==FL_EPWM_COUNT_IE_SOURCE_CNT_0ORCNT_PRD)\
                                                                         ||((__VALUE__)==FL_EPWM_COUNT_IE_SOURCE_CNT_CMPA_UP)\
                                                                         ||((__VALUE__)==FL_EPWM_COUNT_IE_SOURCE_CNT_CMPA_DOWN)\
                                                                         ||((__VALUE__)==FL_EPWM_COUNT_IE_SOURCE_CNT_CMPB_UP)\
                                                                         ||((__VALUE__)==FL_EPWM_COUNT_IE_SOURCE_CNT_CMPB_DOWN)\
                                                                         ||((__VALUE__)==FL_EPWM_COUNT_IE_SOURCE_CNT_CMPC_UP)\
                                                                         ||((__VALUE__)==FL_EPWM_COUNT_IE_SOURCE_CNT_CMPC_DOWN)\
                                                                         ||((__VALUE__)==FL_EPWM_COUNT_IE_SOURCE_CNT_CMPD_UP)\
                                                                         ||((__VALUE__)==FL_EPWM_COUNT_IE_SOURCE_CNT_CMPD_DOWN))

#define IS_FL_EPWM_SOCBSEL(__VALUE__)                                     (((__VALUE__)==FL_EPWM_ADC_SOCB_SOURCE_CNT_DCBEVT1)\
                                                                         ||((__VALUE__)==FL_EPWM_ADC_SOCB_SOURCE_CNT_0)\
                                                                         ||((__VALUE__)==FL_EPWM_ADC_SOCB_SOURCE_CNT_PRD)\
                                                                         ||((__VALUE__)==FL_EPWM_ADC_SOCB_SOURCE_CNT_0ORCNT_PRD)\
                                                                         ||((__VALUE__)==FL_EPWM_ADC_SOCB_SOURCE_CNT_CMPA_UP)\
                                                                         ||((__VALUE__)==FL_EPWM_ADC_SOCB_SOURCE_CNT_CMPA_DOWN)\
                                                                         ||((__VALUE__)==FL_EPWM_ADC_SOCB_SOURCE_CNT_CMPB_UP)\
                                                                         ||((__VALUE__)==FL_EPWM_ADC_SOCB_SOURCE_CNT_CMPB_DOWN)\
                                                                         ||((__VALUE__)==FL_EPWM_ADC_SOCB_SOURCE_CNT_CMPC_UP)\
                                                                         ||((__VALUE__)==FL_EPWM_ADC_SOCB_SOURCE_CNT_CMPC_DOWN)\
                                                                         ||((__VALUE__)==FL_EPWM_ADC_SOCB_SOURCE_CNT_CMPD_UP)\
                                                                         ||((__VALUE__)==FL_EPWM_ADC_SOCB_SOURCE_CNT_CMPD_DOWN))

#define IS_FL_EPWM_SOCASEL(__VALUE__)                                     (((__VALUE__)==FL_EPWM_ADC_SOCA_SOURCE_CNT_DCAEVT1)\
                                                                         ||((__VALUE__)==FL_EPWM_ADC_SOCA_SOURCE_CNT_0)\
                                                                         ||((__VALUE__)==FL_EPWM_ADC_SOCA_SOURCE_CNT_PRD)\
                                                                         ||((__VALUE__)==FL_EPWM_ADC_SOCA_SOURCE_CNT_0ORCNT_PRD)\
                                                                         ||((__VALUE__)==FL_EPWM_ADC_SOCA_SOURCE_CNT_CMPA_UP)\
                                                                         ||((__VALUE__)==FL_EPWM_ADC_SOCA_SOURCE_CNT_CMPA_DOWN)\
                                                                         ||((__VALUE__)==FL_EPWM_ADC_SOCA_SOURCE_CNT_CMPB_UP)\
                                                                         ||((__VALUE__)==FL_EPWM_ADC_SOCA_SOURCE_CNT_CMPB_DOWN)\
                                                                         ||((__VALUE__)==FL_EPWM_ADC_SOCA_SOURCE_CNT_CMPC_UP)\
                                                                         ||((__VALUE__)==FL_EPWM_ADC_SOCA_SOURCE_CNT_CMPC_DOWN)\
                                                                         ||((__VALUE__)==FL_EPWM_ADC_SOCA_SOURCE_CNT_CMPD_UP)\
                                                                         ||((__VALUE__)==FL_EPWM_ADC_SOCA_SOURCE_CNT_CMPD_DOWN))

#define IS_FL_EPWM_PCNTPSC(__VALUE__)                                    (((__VALUE__)==FL_EPWM_PULSE_EVENT_N0)\
                                                                         ||((__VALUE__)==FL_EPWM_PULSE_EVENT_N1)\
                                                                         ||((__VALUE__)==FL_EPWM_PULSE_EVENT_N2)\
                                                                         ||((__VALUE__)==FL_EPWM_PULSE_EVENT_N3)\
                                                                         ||((__VALUE__)==FL_EPWM_PULSE_EVENT_N4)\
                                                                         ||((__VALUE__)==FL_EPWM_PULSE_EVENT_N5)\
                                                                         ||((__VALUE__)==FL_EPWM_PULSE_EVENT_N6)\
                                                                         ||((__VALUE__)==FL_EPWM_PULSE_EVENT_N7)\
                                                                         ||((__VALUE__)==FL_EPWM_PULSE_EVENT_N8)\
                                                                         ||((__VALUE__)==FL_EPWM_PULSE_EVENT_N9)\
                                                                         ||((__VALUE__)==FL_EPWM_PULSE_EVENT_N10)\
                                                                         ||((__VALUE__)==FL_EPWM_PULSE_EVENT_N11)\
                                                                          ||((__VALUE__)==FL_EPWM_PULSE_EVENT_N12)\
                                                                           ||((__VALUE__)==FL_EPWM_PULSE_EVENT_N13)\
                                                                            ||((__VALUE__)==FL_EPWM_PULSE_EVENT_N14)\
                                                                             ||((__VALUE__)==FL_EPWM_PULSE_EVENT_N15))

#define IS_FL_EPWM_SOCBPSC(__VALUE__)                                    (((__VALUE__)==FL_EPWM_SOCB_EVENT_N0)\
                                                                         ||((__VALUE__)==FL_EPWM_SOCB_EVENT_N1)\
                                                                         ||((__VALUE__)==FL_EPWM_SOCB_EVENT_N2)\
                                                                         ||((__VALUE__)==FL_EPWM_SOCB_EVENT_N3)\
                                                                         ||((__VALUE__)==FL_EPWM_SOCB_EVENT_N4)\
                                                                         ||((__VALUE__)==FL_EPWM_SOCB_EVENT_N5)\
                                                                         ||((__VALUE__)==FL_EPWM_SOCB_EVENT_N6)\
                                                                         ||((__VALUE__)==FL_EPWM_SOCB_EVENT_N7)\
                                                                         ||((__VALUE__)==FL_EPWM_SOCB_EVENT_N8)\
                                                                         ||((__VALUE__)==FL_EPWM_SOCB_EVENT_N9)\
                                                                         ||((__VALUE__)==FL_EPWM_SOCB_EVENT_N10)\
                                                                         ||((__VALUE__)==FL_EPWM_SOCB_EVENT_N11)\
                                                                          ||((__VALUE__)==FL_EPWM_SOCB_EVENT_N12)\
                                                                           ||((__VALUE__)==FL_EPWM_SOCB_EVENT_N13)\
                                                                            ||((__VALUE__)==FL_EPWM_SOCB_EVENT_N14)\
                                                                             ||((__VALUE__)==FL_EPWM_SOCB_EVENT_N15))

#define IS_FL_EPWM_SOCAPSC(__VALUE__)                                    (((__VALUE__)==FL_EPWM_SOCA_EVENT_N0)\
                                                                         ||((__VALUE__)==FL_EPWM_SOCA_EVENT_N1)\
                                                                         ||((__VALUE__)==FL_EPWM_SOCA_EVENT_N2)\
                                                                         ||((__VALUE__)==FL_EPWM_SOCA_EVENT_N3)\
                                                                         ||((__VALUE__)==FL_EPWM_SOCA_EVENT_N4)\
                                                                         ||((__VALUE__)==FL_EPWM_SOCA_EVENT_N5)\
                                                                         ||((__VALUE__)==FL_EPWM_SOCA_EVENT_N6)\
                                                                         ||((__VALUE__)==FL_EPWM_SOCA_EVENT_N7)\
                                                                         ||((__VALUE__)==FL_EPWM_SOCA_EVENT_N8)\
                                                                         ||((__VALUE__)==FL_EPWM_SOCA_EVENT_N9)\
                                                                         ||((__VALUE__)==FL_EPWM_SOCA_EVENT_N10)\
                                                                         ||((__VALUE__)==FL_EPWM_SOCA_EVENT_N11)\
                                                                          ||((__VALUE__)==FL_EPWM_SOCA_EVENT_N12)\
                                                                           ||((__VALUE__)==FL_EPWM_SOCA_EVENT_N13)\
                                                                            ||((__VALUE__)==FL_EPWM_SOCA_EVENT_N14)\
                                                                             ||((__VALUE__)==FL_EPWM_SOCA_EVENT_N15))

#define IS_FL_EPWM_RED_MASK(__VALUE__)                                 (__VALUE__<=1023U)
#define IS_FL_EPWM_FED_MASK(__VALUE__)                                 (__VALUE__<=1023U)

/**
  * @brief  配置基本定时器时基单元（内部时钟源）.
  * @param  TIMx Timer Instance
  * @param  TIM_InitStruct 指向一个 @ref FL_EPWM_InitTypeDef(时基配置结构体)
  * @retval ErrorStatus枚举值
  *         -FL_FAIL 配置过程发生错误
  *         -FL_PASS 成功
  */

FL_ErrorStatus FL_EPWM_Init(EPWM_Type *TIMx, FL_EPWM_InitTypeDef *TIM_InitStruct)
{

    /* 参数检查 */
    assert_param(IS_EPWM_INSTANCE(TIMx));
    assert_param(IS_FL_EPWM_COUNTERMODE(TIM_InitStruct->counterMode));
    assert_param(IS_FL_EPWM_DEBUGMODE(TIM_InitStruct->DBGMode));
    assert_param(IS_FL_EPWM_STARTCOUNTDIR(TIM_InitStruct->startCounterDir));
    assert_param(IS_FL_EPWM_CLKSOURCE(TIM_InitStruct->clockSrc));
    /* 时钟总线使能配置 */
    if(TIMx == EPWM0)
    {
        FL_CMU_SetEPWMClockSource(TIM_InitStruct->clockSrc);
        FL_CMU_EnableGroup4BusClock(FL_CMU_GROUP4_BUSCLK_EPWM);
        FL_CMU_EnableGroup2OperationClock(FL_CMU_OPCLK_EPWM0);
    }
    else if(TIMx == EPWM1)
    {
        FL_CMU_EnableGroup4BusClock(FL_CMU_GROUP4_BUSCLK_EPWM);
        FL_CMU_SetEPWMClockSource(TIM_InitStruct->clockSrc);
        FL_CMU_EnableGroup2OperationClock(FL_CMU_OPCLK_EPWM1);
    }
    else if(TIMx == EPWM2)
    {
        FL_CMU_EnableGroup4BusClock(FL_CMU_GROUP4_BUSCLK_EPWM);
        FL_CMU_SetEPWMClockSource(TIM_InitStruct->clockSrc);
        FL_CMU_EnableGroup2OperationClock(FL_CMU_OPCLK_EPWM2);
    }
    else if(TIMx == EPWM3)
    {
        FL_CMU_EnableGroup4BusClock(FL_CMU_GROUP4_BUSCLK_EPWM);
        FL_CMU_SetEPWMClockSource(TIM_InitStruct->clockSrc);
        FL_CMU_EnableGroup2OperationClock(FL_CMU_OPCLK_EPWM3);
    }
    if(TIM_InitStruct->periodAutoReload == FL_ENABLE)
    { FL_EPWM_EnablePRDPreload(TIMx); }
    else if(TIM_InitStruct->periodAutoReload == FL_DISABLE)
    { FL_EPWM_DisablePRDPreload(TIMx); }

    if(TIM_InitStruct->phaseLoad == FL_ENABLE)
    { FL_EPWM_EnablePhaseReload(TIMx); }
    else if(TIM_InitStruct->phaseLoad == FL_DISABLE)
    { FL_EPWM_DisablePhaseReload(TIMx); }

    FL_EPWM_SetCounterMode(TIMx, TIM_InitStruct->counterMode);
    FL_EPWM_SetDebugMode(TIMx, TIM_InitStruct->DBGMode);
    FL_EPWM_SetInitialPhaseDirection(TIMx, TIM_InitStruct->startCounterDir);
    FL_EPWM_WriteAutoReload(TIMx, TIM_InitStruct->period);
    FL_EPWM_WritePhaseLoad(TIMx, TIM_InitStruct->phase);
    FL_EPWM_WritePrescaler(TIMx, TIM_InitStruct->prescaler);

    return FL_PASS;
}
/**
  * @brief  设置 EPWM_InitStruct 为默认配置
  * @param  EPWM_InitStruct 指向需要将值设置为默认配置的结构体 @ref FL_EPWM_InitTypeDef 结构体
  *
  * @retval None
  */
void FL_EPWM_StructInit(FL_EPWM_InitTypeDef *TIM_InitStruct)
{
    TIM_InitStruct->clockSrc = FL_CMU_EPWM1_CLK_SOURCE_APBCLK;
    TIM_InitStruct->counterMode = FL_EPWM_COUNTER_MODE_UP;
    TIM_InitStruct->DBGMode = FL_EPWM_DEBUG_FREE_RUN;
    TIM_InitStruct->period = 65535U;
    TIM_InitStruct->periodAutoReload = FL_ENABLE;
    TIM_InitStruct->phase = 0;
    TIM_InitStruct->phaseLoad = FL_ENABLE;
    TIM_InitStruct->prescaler = 8 - 1;
    TIM_InitStruct->startCounterDir = FL_EPWM_COUNTER_SYNC_DIR_UP;

