waterinthefall/FDU-Microelectronics-Development-Project/Drivers/FM33FK5xx_FL_Driver/Src/fm33fk5xx_fl_epwm.c
}

/**
  * @brief  配置输出寄存器单元.
  * @param  TIMx Timer Instance
  * @param  TIM_InitStruct 指向一个 @ref FL_EPWM_OC_InitTypeDef(时基配置结构体)
  * @retval ErrorStatus枚举值
  *         -FL_FAIL 配置过程发生错误
  *         -FL_PASS 成功
  */
FL_ErrorStatus FL_EPWM_OC_Init(EPWM_Type *TIMx, uint32_t channel, FL_EPWM_OC_InitTypeDef *TIM_InitStruct)
{
    assert_param(IS_FL_EPWM_CHANNEL(channel));
    assert_param(IS_FL_EPWM_OCLOADTRIGGER(TIM_InitStruct->OCLoadtrigger));
    assert_param(IS_FL_EPWM_OCMODE_CNTEQUALCMPB_DIRDOWN(TIM_InitStruct->OCMode_CNTEqualCMPB_DirDown));
    assert_param(IS_FL_EPWM_OCMODE_CNTEQUALCMPB_DIRUP(TIM_InitStruct->OCMode_CNTEqualCMPB_DirUp));
    assert_param(IS_FL_EPWM_OCMODE_CNTEQUALCMPA_DIRDOWN(TIM_InitStruct->OCMode_CNTEqualCMPA_DirDown));
    assert_param(IS_FL_EPWM_OCMODE_CNTEQUALCMPA_DIRUP(TIM_InitStruct->OCMode_CNTEqualCMPA_DirUp));
    assert_param(IS_FL_EPWM_OCMODE_CNTEQUALPRD(TIM_InitStruct->OCMode_CNTEqualPRD));
    assert_param(IS_FL_EPWM_OCMODE_CNTEQUALZRO(TIM_InitStruct->OCMode_CNTEqualZRO));
    if(TIM_InitStruct->OCautoReload == FL_ENABLE)
    { FL_EPWM_OC_EnablePreload(TIMx, channel); }
    else if(TIM_InitStruct->OCautoReload == FL_DISABLE)
    { FL_EPWM_OC_DisablePreload(TIMx, channel); }

    FL_EPWM_OC_SetpreloadTrigger(TIMx, TIM_InitStruct->OCLoadtrigger, channel);
    FL_EPWM_SetOCMode_CNTEqualCMPB_DirDown(TIMx, TIM_InitStruct->OCMode_CNTEqualCMPB_DirDown, channel);
    FL_EPWM_SetOCMode_CNTEqualCMPB_DirUp(TIMx, TIM_InitStruct->OCMode_CNTEqualCMPB_DirUp, channel);
    FL_EPWM_SetOCMode_CNTEqualCMPA_DirDown(TIMx, TIM_InitStruct->OCMode_CNTEqualCMPA_DirDown, channel);
    FL_EPWM_SetOCMode_CNTEqualCMPA_DirUp(TIMx, TIM_InitStruct->OCMode_CNTEqualCMPA_DirUp, channel);
    FL_EPWM_SetOCMode_CNTEqualPRD(TIMx, TIM_InitStruct->OCMode_CNTEqualPRD, channel);
    FL_EPWM_SetOCMode_CNTEqualZero(TIMx, TIM_InitStruct->OCMode_CNTEqualZRO, channel);
    return FL_PASS;
}

/**
  * @brief  设置 EPWM_InitStruct 为默认配置
  * @param  EPWM_InitStruct 指向需要将值设置为默认配置的结构体 @ref FL_OC_InitTypeDef 结构体
  *
  * @retval None
  */
void FL_EPWM_OC_StructInit(FL_EPWM_OC_InitTypeDef *TIM_InitStruct)
{
    TIM_InitStruct->OCautoReload = FL_ENABLE;
    TIM_InitStruct->OCLoadtrigger =  FL_EPWM_OC_LOAD_CNT_0;
    TIM_InitStruct->OCMode_CNTEqualCMPA_DirDown = FL_EPWM_OC_MODE_TOGGLE;
    TIM_InitStruct->OCMode_CNTEqualCMPA_DirUp = FL_EPWM_OC_MODE_TOGGLE;
    TIM_InitStruct->OCMode_CNTEqualCMPB_DirDown = FL_EPWM_OC_MODE_TOGGLE;
    TIM_InitStruct->OCMode_CNTEqualCMPB_DirUp =  FL_EPWM_OC_MODE_TOGGLE;
    TIM_InitStruct->OCMode_CNTEqualPRD =  FL_EPWM_OC_MODE_TOGGLE;
    TIM_InitStruct->OCMode_CNTEqualZRO =  FL_EPWM_OC_MODE_TOGGLE;

}
/**
  * @brief  配置输出寄存器单元.
  * @param  TIMx Timer Instance
  * @param  TIM_InitStruct 指向一个 @ref FL_EPWM_CMP_InitTypeDef(时基配置结构体)
  * @retval ErrorStatus枚举值
  *         -FL_FAIL 配置过程发生错误
  *         -FL_PASS 成功
  */
FL_ErrorStatus FL_EPWM_CMP_Init(EPWM_Type *TIMx, uint32_t channel, FL_EPWM_CMP_InitTypeDef *TIM_InitStruct)
{
    assert_param(IS_FL_EPWM_CMPCHANNEL(channel));
    assert_param(IS_FL_EPWM_OCLOADTRIGGER(TIM_InitStruct->CMPLoadTrigger));

    switch(channel)
    {
        case  FL_EPWM_COMPARED:
            if(TIM_InitStruct->CMPAutoReload == FL_ENABLE)
            { FL_EPWM_EnableCompareDPreload(TIMx); }
            else if(TIM_InitStruct->CMPAutoReload == FL_ENABLE)
            { FL_EPWM_EnableCompareDPreload(TIMx); }
            FL_EPWM_SetCompareDPreloadTrigger(TIMx, TIM_InitStruct->CMPLoadTrigger);
            break;
        case  FL_EPWM_COMPAREC:
            if(TIM_InitStruct->CMPAutoReload == FL_ENABLE)
            { FL_EPWM_EnableCompareCPreload(TIMx); }
            else if(TIM_InitStruct->CMPAutoReload == FL_ENABLE)
            { FL_EPWM_EnableCompareCPreload(TIMx); }
            FL_EPWM_SetCompareCPreloadTrigger(TIMx, TIM_InitStruct->CMPLoadTrigger);
            break;
        case  FL_EPWM_COMPAREB:
            if(TIM_InitStruct->CMPAutoReload == FL_ENABLE)
            { FL_EPWM_EnableCompareBPreload(TIMx); }
            else if(TIM_InitStruct->CMPAutoReload == FL_ENABLE)
            { FL_EPWM_EnableCompareBPreload(TIMx); }
            FL_EPWM_SetCompareBPreloadTrigger(TIMx, TIM_InitStruct->CMPLoadTrigger);
            break;
        case  FL_EPWM_COMPAREA:
            if(TIM_InitStruct->CMPAutoReload == FL_ENABLE)
            { FL_EPWM_EnableCompareAPreload(TIMx); }
            else if(TIM_InitStruct->CMPAutoReload == FL_ENABLE)
            { FL_EPWM_EnableCompareAPreload(TIMx); }
            FL_EPWM_SetCompareAPreloadTrigger(TIMx, TIM_InitStruct->CMPLoadTrigger);
            break;
        default:
            break;
    }

    return FL_PASS;
}

/**
  * @brief  设置 EPWM_InitStruct 为默认配置
  * @param  EPWM_InitStruct 指向需要将值设置为默认配置的结构体 @ref FL_CMP_InitTypeDef 结构体
  *
  * @retval None
  */
void FL_EPWM_CMP_StructInit(FL_EPWM_CMP_InitTypeDef *TIM_InitStruct)
{
    TIM_InitStruct->CMPAutoReload = FL_ENABLE;
    TIM_InitStruct->CMPLoadTrigger = FL_EPWM_OC_LOAD_CNT_PRD;

}

/**
  * @brief  配置死区寄存器单元.
  * @param  TIMx Timer Instance
  * @param  TIM_InitStruct 指向一个 @ref FL_ATIM_DT_InitTypeDef(时基配置结构体)
  * @retval ErrorStatus枚举值
  *         -FL_FAIL 配置过程发生错误
  *         -FL_PASS 成功
  */
FL_ErrorStatus FL_EPWM_DT_Init(EPWM_Type *TIMx, uint32_t channel, FL_EPWM_DT_InitTypeDef *TIM_InitStruct)
{

    assert_param(IS_FL_EPWM_REDSRC(TIM_InitStruct->REDSrc));
    assert_param(IS_FL_EPWM_FEDSRC(TIM_InitStruct->FEDSrc));
    assert_param(IS_FL_EPWM_CHANNELBOUTPUTPOLAR(TIM_InitStruct->ChannelOutputPolar));
    assert_param(IS_FL_EPWM_RED_MASK(TIM_InitStruct->REDDelayTime));
    assert_param(IS_FL_EPWM_FED_MASK(TIM_InitStruct->FEDDelayTime));

    FL_EPWM_WriteDeadbandRisingDelayTime(TIMx, TIM_InitStruct->REDDelayTime);
    FL_EPWM_WriteDeadbandFallingDelayTime(TIMx, TIM_InitStruct->FEDDelayTime);

    FL_EPWM_SetDeadbandRisingDelaySignalSource(TIMx, TIM_InitStruct->REDSrc);
    FL_EPWM_SetDeadbandFallingDelaySignalSource(TIMx, TIM_InitStruct->FEDSrc);

    FL_EPWM_SetDeadbandOutputPolarity(TIMx, TIM_InitStruct->ChannelOutputPolar, channel);
    if(TIM_InitStruct->ChannelBypass == FL_ENABLE)
    { FL_EPWM_EnableDeadbandBypass(TIMx, channel); }
    else if(TIM_InitStruct->ChannelBypass == FL_DISABLE)
    { FL_EPWM_DisableDeadbandBypass(TIMx, channel); }

    return FL_PASS;
}

/**
  * @brief  设置 EPWM_InitStruct 为默认配置
  * @param  EPWM_InitStruct 指向需要将值设置为默认配置的结构体 @ref FL_DT_InitTypeDef 结构体
  *
  * @retval None
  */
void FL_EPWM_DT_StructInit(FL_EPWM_DT_InitTypeDef *TIM_InitStruct)
{
    TIM_InitStruct->ChannelBypass = FL_ENABLE;
    TIM_InitStruct->ChannelOutputPolar = FL_EPWM_DEADBAND_PORLARITY_NORMAL;
    TIM_InitStruct->FEDDelayTime = 512U;
    TIM_InitStruct->REDDelayTime = 512U;
    TIM_InitStruct->FEDSrc = FL_EPWM_DEADBAND_FALLING_EPWMB;
    TIM_InitStruct->REDSrc =  FL_EPWM_DEADBAND_RISING_EPWMB;
}

/**
  * @brief  配置死区寄存器单元.
  * @param  TIMx Timer Instance
  * @param  TIM_InitStruct 指向一个 @ref FL_ATIM_CHP_InitTypeDef(时基配置结构体)
  * @retval ErrorStatus枚举值
  *         -FL_FAIL 配置过程发生错误
  *         -FL_PASS 成功
  */
FL_ErrorStatus FL_EPWM_CHP_Init(EPWM_Type *TIMx, uint32_t channel, FL_EPWM_CHP_InitTypeDef *TIM_InitStruct)
{

    assert_param(IS_FL_EPWM_CHPHW_MASK(TIM_InitStruct->chopperHighWidth));
    assert_param(IS_FL_EPWM_CHPLW_MASK(TIM_InitStruct->chopperLowWidth));
    assert_param(IS_FL_EPWM_OSP_MASK(TIM_InitStruct->oneShotPulseWidth));

    FL_EPWM_WriteChopperCarrierHighWidth(TIMx, TIM_InitStruct->chopperHighWidth);
    FL_EPWM_WriteChopperCarrierLowWidth(TIMx, TIM_InitStruct->chopperLowWidth);
    FL_EPWM_WriteOneShotPulseWidth(TIMx, TIM_InitStruct->oneShotPulseWidth);
    if(TIM_InitStruct->oneShotMode == FL_ENABLE)
    { FL_EPWM_EnableOneShotPulse(TIMx); }
    else if(TIM_InitStruct->oneShotMode == FL_DISABLE)
    { FL_EPWM_DisableOneShotPulse(TIMx); }

    if(TIM_InitStruct->channelChopper == FL_ENABLE)
    { FL_EPWM_EnableChopper(TIMx, channel); }
    else if(TIM_InitStruct->channelChopper == FL_DISABLE)
    { FL_EPWM_EnableChopper(TIMx, channel); }

    return FL_PASS;
}

/**
  * @brief  设置 EPWM_InitStruct 为默认配置
  * @param  EPWM_InitStruct 指向需要将值设置为默认配置的结构体 @ref FL_CHP_InitTypeDef 结构体
  *
  * @retval None
  */
void FL_EPWM_CHP_StructInit(FL_EPWM_CHP_InitTypeDef *TIM_InitStruct)
{

    TIM_InitStruct->channelChopper = FL_DISABLE;
    TIM_InitStruct->chopperHighWidth = 10U;
    TIM_InitStruct->chopperLowWidth = 10U;
    TIM_InitStruct->oneShotMode =  FL_DISABLE;
    TIM_InitStruct->oneShotPulseWidth = 5U;
}

/**
  * @brief  配置死区寄存器单元.
  * @param  TIMx Timer Instance
  * @param  TIM_InitStruct 指向一个 @ref FL_ATIM_DCEvent_InitTypeDef(时基配置结构体)
  * @retval ErrorStatus枚举值
  *         -FL_FAIL 配置过程发生错误
  *         -FL_PASS 成功
  */
FL_ErrorStatus FL_EPWM_DCEvent_Init(EPWM_Type *TIMx, uint32_t event, FL_EPWM_DCEvent_InitTypeDef *TIM_InitStruct)
{

    assert_param(IS_FL_EPWM_DCBEVTACTIVE(TIM_InitStruct->DCBEVTActive));
    assert_param(IS_FL_EPWM_DCAEVTACTIVE(TIM_InitStruct->DCAEVTActive));
    assert_param(IS_FL_EPWM_DCBLINPUTSRC(TIM_InitStruct->DCBLInputSrc));
    assert_param(IS_FL_EPWM_DCBHINPUTSRC(TIM_InitStruct->DCBHInputSrc));
    assert_param(IS_FL_EPWM_DCALINPUTSRC(TIM_InitStruct->DCALInputSrc));
    assert_param(IS_FL_EPWM_DCAHINPUTSRC(TIM_InitStruct->DCAHInputSrc));

    FL_EPWM_SetDCBBreakEvent(TIMx, TIM_InitStruct->DCBEVTActive, event);
    FL_EPWM_SetDCABreakEvent(TIMx, TIM_InitStruct->DCAEVTActive, event);
    FL_EPWM_SetDCALInputSource(TIMx, TIM_InitStruct->DCALInputSrc);
    FL_EPWM_SetDCAHInputSource(TIMx, TIM_InitStruct->DCAHInputSrc);
    FL_EPWM_SetDCBLInputSource(TIMx, TIM_InitStruct->DCBLInputSrc);
    FL_EPWM_SetDCBHInputSource(TIMx, TIM_InitStruct->DCBHInputSrc);

    return FL_PASS;
}

/**
  * @brief  设置 EPWM_InitStruct 为默认配置
  * @param  EPWM_InitStruct 指向需要将值设置为默认配置的结构体 @ref FL_CHP_InitTypeDef 结构体
  *
  * @retval None
  */
void FL_EPWM_DCEvent_StructInit(FL_EPWM_DCEvent_InitTypeDef *TIM_InitStruct)
{

    TIM_InitStruct->DCAEVTActive = FL_DISABLE ;
    TIM_InitStruct->DCBEVTActive = FL_DISABLE ;
    TIM_InitStruct->DCBLInputSrc = FL_EPWM_INPUT_SOURCE_BK1;
    TIM_InitStruct->DCALInputSrc = FL_EPWM_INPUT_SOURCE_BK2;
    TIM_InitStruct->DCBHInputSrc =  FL_EPWM_INPUT_SOURCE_BK1;
    TIM_InitStruct->DCBLInputSrc = FL_EPWM_INPUT_SOURCE_BK2;
}

/**
  * @brief  配置死区寄存器单元.
  * @param  TIMx Timer Instance
  * @param  TIM_InitStruct 指向一个 @ref FL_ATIM_SOC_InitTypeDef(时基配置结构体)
  * @retval ErrorStatus枚举值
  *         -FL_FAIL 配置过程发生错误
  *         -FL_PASS 成功
  */
FL_ErrorStatus FL_EPWM_SOC_Init(EPWM_Type *TIMx, FL_EPWM_SOC_InitTypeDef *TIM_InitStruct)
{

