waterinthefall/FDU-Microelectronics-Development-Project/Drivers/FM33FK5xx_FL_Driver/Src/fm33fk5xx_fl_epwm.c
    assert_param(IS_FL_EPWM_PCNTSEL(TIM_InitStruct->pulseCNTInterruptSrc));
    assert_param(IS_FL_EPWM_SOCBSEL(TIM_InitStruct->SOCBInputSrc));
    assert_param(IS_FL_EPWM_SOCASEL(TIM_InitStruct->SOCAInputSrc));
    assert_param(IS_FL_EPWM_PCNTPSC(TIM_InitStruct->pulseCNTEventPsc));
    assert_param(IS_FL_EPWM_SOCBPSC(TIM_InitStruct->SOCBEventPsc));
    assert_param(IS_FL_EPWM_SOCAPSC(TIM_InitStruct->SOCAEventPsc));

    FL_EPWM_SetPulseCountInterruptSignalSource(TIMx, TIM_InitStruct->pulseCNTInterruptSrc);
    FL_EPWM_SetADCSOCBSignalSource(TIMx, TIM_InitStruct->SOCBInputSrc);
    FL_EPWM_SetADCSOCASignalSource(TIMx, TIM_InitStruct->SOCAInputSrc);

    FL_EPWM_SetPulseCountInterruptTriggerCondition(TIMx, TIM_InitStruct->pulseCNTEventPsc);
    FL_EPWM_SetSOCBOutputCondition(TIMx, TIM_InitStruct->SOCBEventPsc);
    FL_EPWM_SetSOCAOutputCondition(TIMx, TIM_InitStruct->SOCAEventPsc);

    if(TIM_InitStruct->SOCBEventState == FL_ENABLE)
    { FL_EPWM_EnableADCSOCBEvent(TIMx); }
    else if(TIM_InitStruct->SOCBEventState == FL_DISABLE)
    { FL_EPWM_DisableADCSOCBEvent(TIMx); }

    if(TIM_InitStruct->SOCAEventState == FL_ENABLE)
    { FL_EPWM_EnableADCSOCAEvent(TIMx); }
    else if(TIM_InitStruct->SOCAEventState == FL_DISABLE)
    { FL_EPWM_DisableADCSOCAEvent(TIMx); }

    return FL_PASS;
}

/**
  * @brief  设置 EPWM_InitStruct 为默认配置
  * @param  EPWM_InitStruct 指向需要将值设置为默认配置的结构体 @ref FL_SOC_InitTypeDef 结构体
  *
  * @retval None
  */
void FL_EPWM_SOC_StructInit(FL_EPWM_SOC_InitTypeDef *TIM_InitStruct)
{

    TIM_InitStruct->pulseCNTEventPsc = FL_EPWM_PULSE_EVENT_N1;
    TIM_InitStruct->pulseCNTInterruptSrc =  FL_EPWM_COUNT_IE_SOURCE_CNT_PRD;
    TIM_InitStruct->SOCAEventPsc = FL_EPWM_SOCA_EVENT_N1;
    TIM_InitStruct->SOCAEventState = FL_ENABLE ;
    TIM_InitStruct->SOCAInputSrc = FL_EPWM_ADC_SOCA_SOURCE_CNT_PRD;
    TIM_InitStruct->SOCBEventPsc = FL_EPWM_SOCB_EVENT_N1;
    TIM_InitStruct->SOCBEventState = FL_ENABLE ;
    TIM_InitStruct->SOCBInputSrc = FL_EPWM_ADC_SOCB_SOURCE_CNT_PRD;

}

#endif /* FL_EPWM_DRIVER_ENABLED */

/**
  * @}
  */

/**
  * @}
  */

/*************************(C) COPYRIGHT Fudan Microelectronics **** END OF FILE*************************/
